_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
emb-input (InputLayer)       (None, 26)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 400)               10800     
_________________________________________________________________
dense_4 (Dense)              (None, 26)                10426     
=================================================================
Total params: 21,226
Trainable params: 21,226
Non-trainable params: 0
_________________________________________________________________
----Average----
accuracy: 0.6610 
f1 macro score: 0.6607 
f1 micro score: 0.6610 
Accuracy	Macro F1	MicroF1
0.6610	0.6607	0.6610

train and test time: 213.79s
